app/controllers/playlists_controller.rb

INSERT INTO "playlists" ("manager_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["manager_id", 1], ["created_at", "2018-06-11 20:24:33.428766"], ["updated_at", "2018-06-11 20:24:33.428766"]]
UPDATE "playlists" SET "join_name" = ?, "join_password" = ?, "updated_at" = ? WHERE "playlists"."id" = ?  [["join_name", "new"], ["join_password", "new"], ["updated_at", "2018-06-11 20:24:33.433209"], ["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def create
		@playlist = Playlist.create(manager_id: params[:manager_id])
		@playlist.update(params.require(:playlist).permit(:join_name, :join_password))
		@playlist.curr_index = 0
		@playlist.active = true
		@playlist.save
		@admin = User.find(@playlist.manager_id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def join
		$requester = User.find(params[:user_id])

SELECT  "playlists".* FROM "playlists" WHERE (join_name = 'new' and join_password = 'new') ORDER BY "playlists"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "users".* FROM "users" INNER JOIN "playlists_users" ON "users"."id" = "playlists_users"."user_id" WHERE "playlists_users"."playlist_id" = ? AND (user_id = 1 and playlist_id = 1) ORDER BY "users"."id" ASC LIMIT ?  [["playlist_id", 1], ["LIMIT", 1]]
---
	def grant_access
		form_name = params[:join_name]
		form_pass = params[:join_password]
		@playlist = Playlist.where("join_name = :join_name and join_password = :join_password", {join_name: form_name, join_password: form_pass }).first
		if @playlist.nil?
			flash[:error] = "Incorrect join name or password. Please try again."
			render 'join_form'

		else
			#render 'playlist_page'
			#@tempUser = @playlist.users.where(id: $requester.id).first
			@tempUser = @playlist.users.where("user_id = :user_id and playlist_id = :playlist_id", {user_id: $requester.id, playlist_id: @playlist.id}).first

SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@playlist = Playlist.find(params[:id])
		$user = User.find(params[:user_id])