app/controllers/songs_controller.rb

	def new
		@song = Song.new
		$song_user = User.find(params[:user_id])
		$playlist = Playlist.find(params[:playlist_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def create


		song_name = params[:song_name]
		artist_name = params[:artist_name]
		videos = Yt::Collections::Videos.new
		filtered_vids = videos.where(part: "snippet", q:song_name + " " + artist_name, order: "viewCount", safeSearch: "moderate")
		@video = filtered_vids.first



		@song = Song.create(videoID: @video.id)
		@song.song_name = song_name
		@song.artist_name = artist_name
		@song.playlist_id = $playlist.id
		@song.save
---
INSERT INTO "songs" ("created_at", "updated_at", "videoID") VALUES (?, ?, ?)  [["created_at", "2018-06-11 20:54:57.031390"], ["updated_at", "2018-06-11 20:54:57.031390"], ["videoID", "oTXCgR93zC8"]]
UPDATE "songs" SET "song_name" = ?, "artist_name" = ?, "playlist_id" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["song_name", "red"], ["artist_name", "hyuna"], ["playlist_id", 1], ["updated_at", "2018-06-11 20:55:24.876736"], ["id", 2]]

	def destroy
		song_name = params[:song_name]
		artist_name = params[:artist_name]
		@songToDelete = Song.where("song_name = :song_name and artist_name = :artist_name and playlist_id = :playlist_id", {song_name: song_name, artist_name: artist_name, playlist_id: $playlist.id}).first
		if @songToDelete != nil
			@songToDelete.destroy
---
SELECT  "songs".* FROM "songs" WHERE (song_name = 'red' and artist_name = 'hyuna' and playlist_id = 2) ORDER BY "songs"."id" ASC LIMIT ?  [["LIMIT", 1]]
DELETE FROM "songs" WHERE "songs"."id" = ?  [["id", 3]]