app/views/playlists/playlist_page.html.erb


			<% @playlist.songs.each do |s| %>
---
SELECT "songs".* FROM "songs" INNER JOIN "playlists_songs" ON "songs"."id" = "playlists_songs"."song_id" WHERE "playlists_songs"."playlist_id" = ?  [["playlist_id", 1]]